import 'package:flutter/material.dart';

class InsurancePage extends StatelessWidget {
  const InsurancePage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("保險保障詳情"),
        backgroundColor: const Color.fromRGBO(255, 239, 239, 1.0),
      ),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                "保險與保障詳情",
                style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              Text(
                "我們與旺旺友聯合作，提供之保險與保障包括：\n"
                "\n意外–寵物意外傷害：此保障主要係受照顧的寵物若於寵物商家之服務過程中受到意外傷害，可歸責於寵物商家之責任，而受賠償請求時，寵物商家需先墊相關的獸醫醫療費用，自負額為NT\$3,000，就超出自負額之部分，旺旺友聯額外提供NT\$10,000以內之醫療費。若受照顧的寵物遺失，我們會立即於網路上刊登尋寵物廣告，寵物商家與寵物主人需自行達成賠償協議。\n"
                "\n意外–寵物食物中毒：此保障主要係受照顧的寵物若食用寵物商家提供之食物所造成的食物中毒，可歸責於寵物商家之責任，而受賠償請求時，寵物商家需先墊相關的獸醫醫療費用，自負額為NT\$3,000，就超出自負額之部分，旺旺友聯額外提供NT\$10,000以內之醫療費。\n"
                "\n公共責任–寵物商家對第三方的責任與索賠：此保障包含支付寵物商家在服務期間因受照顧的寵物造成的第三方人身傷害或第三方財產損失，可歸責於寵物商家之責任，而受賠償請求時，寵物商家須先墊相關的賠償費用，自負額為NT\$3,000，就超出自負額之部分，旺旺友聯額外提供NT\$2,000,000以內之補助賠償。\n"
                "\n保險與保障不包括下列事項：\n"
                "自負額NT\$3,000元。\n"
                "在捲毛寶寶平台或應用程序以外預訂之服務。\n"
                "寵物商家和寵物商家之家人朋友的意外傷害或疾病、財產損失或損壞。\n"
                "任何人因寵物商家寵物或寵物主人寵物得到的疾病或病毒。\n"
                "任何寵物遺失的賠償。\n"
                "寵物遭野生動物襲擊造成的傷勢。\n"
                "違反專業（例如在不適合的地區散步或是未使用胸背及牽繩散步）。\n"
              ),
              SizedBox(height: 10),
              Text(
                "如何取得保險與保障？\n"
                "透過捲毛寶寶平台預訂及付費的服務，在服務期間內都會有捲毛寶寶所提供下列服務、保險與保障。\n"
                "寵物洗澡\n"
                "寵物住宿\n"
                "但請詳看保險與保障細節及其例外規定\n"
              ),
              SizedBox(height: 10),
              Text(
                "申請賠償前請注意：\n"
                "商家在做任何醫療行為之前應聯絡寵物主人或是寵物的緊急聯絡人。\n"
                "而假使商家在意外發生時聯絡不上寵物主人，寵物主人同意商家可以自行做合理的醫療處理。若意外的責任歸屬在商家，商家需承擔醫療費用；若意外的責任歸屬在與商家無關的第三方人員，寵物主人需補貼醫療費用給商家。\n"
                "請詳細閱讀確認您的寵物是否在捲毛寶寶保障包含範圍內。\n"
              ),
              Text(
                "申請賠償步驟：\n"
                "請寄以下細節到：angushsu123@gmail.com\n"
                "1.訂單截圖，須包含寵物名字、商家名稱、訂單編號\n"
                "2.事件的日期和地點\n"
                "3.描述事故的情況\n"
                "4.寵物受傷和獸醫帳單的照片及寵物主人的獸醫的詳細聯繫方式\n"
                "5.必須在服務結束後三天內通知捲毛寶寶",
              ),
            ],
          ),
        ),
      ),
    );
  }
}
